Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/buying_a_home/property_deeds.html.txt.tmx
Source language: en
Languages: ga

source: • The Land Registry: registration of title
ga: • Clárlann na Talún: teideal a chlárú

source: • Registration of Deeds system
ga: • An Córas Cláraithe Gníomhas

source: There are 2 separate systems for recording property transactions:
ga: Tá dhá chóras ar leith ann chun idirbhearta réadmhaoine a chur i gcuntas:

source: • The registration of title system (Land Registry) which provides a State-guaranteed title to property and
ga: • An córas cláraithe teidil (Clárlann na Talún) a sholáthraíonn teideal atá ráthaithe ag an Stát don réadmhaoin, agus

source: • The registration of deeds system (Registry of Deeds) which records the existence of deeds and conveyances affecting property
ga: • Córas cláraithe na ngníomhas (Clárlann na nGníomhas) a chuireann láithreacht gníomhas agus tíolacas i gcuntas a imríonn tionchar ar an réadmhaoin

source: A title is the ownership of a property and a deed is a written document that affects property
ga: Úinéireacht réadmhaoine atá i gceist le teideal agus cáipéis scríofa is ea gníomhas a imríonn tionchar ar an réadmhaoin

source: Both systems are mutually exclusive
ga: Tá an dá chóras comheisiach

source: Your solicitor will know which of the 2 systems is relevant to your case
ga: Beidh a fhios ag d’aturnae cé acu den dá chóras atá ábhartha i do chás

source: Both systems are under the control and management of the Property Registration Authority (PRA), an independent statutory body set up under the Registration of Deeds and Title Act 2006
ga: Tá an dá chóras faoi rialú agus bainistíocht an Údaráis Chlárúcháin Maoine (ÚCM), ar comhlacht reachtúil neamhspleách iad a bunaíodh faoin Acht um Chlárú Gníomhas agus Teidil, 2006

source: The Land Registry: registration of title
ga: Clárlann na Talún: teideal a chlárú

source: When title or ownership is registered in the Land Registry, all relevant details concerning the property and its ownership are entered on documents known as folios
ga: Nuair a chláraítear teideal nó úinéireacht i gClárlann na Talún, iontráiltear na sonraí ábhartha go léir faoin réadmhaoin agus úinéireacht na réadmhaoine i gcáipéisí ar a dtugtar fóiliónna

source: These form the registers maintained in the Land Registry
ga: Is iad seo na cláir a choimeádtar i gClárlann na Talún

source: Property that is registered at the Land Registry is known as registered land, as every transaction on a property is registered on a folio
ga: Tugtar talamh chláraithe ar an réadmhaoin atá cláraithe i gClárlann na Talún, mar gheall go gcláraítear gach idirbheart i réadmhaoin ar fhóilió

source: The folio is guaranteed by the State to be a confirmed record of the title to the property to which it refers
ga: Ráthaíonn an Stát gur taifead dearbhaithe atá san fhóilió de theideal na réadmhaoine dá dtagraíonn sé

source: A folio is a document that describes the property registered; refers to a plan on the Registry maps; gives the name and address of the registered owner(s) and describes any burdens affecting the property, for example, rights of way or charges (mortgages)
ga: Cáipéis atá i bhfóilió a dhéanann cur síos ar an readmhaoin a cláraíodh; a thagraíonn do phlean atá ar léarscáileanna na Clárlainne; a thugann ainm agus seoladh an úinéara/na n-úinéirí cláraithe agus a dhéanann cur síos ar aon ualaí, mar shampla, ceart slí nó muirir (morgáistí) atá i bhfeidhm ar an réadmhaoin

source: You can use the folio to find out who has the title or ownership of a property, without having to read the original deeds
ga: Féadfaidh tú an fóilió a úsáid lena dheimhniú cé aige a bhfuil teideal nó úinéireacht réadmhaoine, gan bheith ort na bunghníomhais a léamh

source: The Land Registry also maintains maps or title plans of property described in the registers
ga: Ina theannta sin, coimeádann Clárlann na Talún léarscáileanna (nó pleananna teidil) de chuid réadmhaoine a ndéantar cur síos orthu sna cláir

source: These maps do not indicate whether a boundary includes a hedge, wall, ditch etc., so the registers are therefore not conclusive as to boundaries
ga: Ní thugtar le fios ar na léarscáileanna seo cibé acu an áirítear le teorainn fál, balla, díog etc., mar sin, níl na cláir críochnaitheach, ar an ábhar sin, i dtaobh teorainneacha

source: Any dispute as to boundaries must be resolved by the relevant parties - if they cannot reach agreement it is a matter for the courts to resolve
ga: Ní mór do na páirtithe ábhartha aon díospóidí maidir le teorainneacha a réiteach – murar féidir leo comhaontú a bhaint amach, is faoi na cúirteanna atá sé chun an cheist a réiteach

source: You can search for a folio or title plan on landdirect.ie or you can inspect a plain copy of a folio in the PRA’s public offices, which costs €5
ga: Féadfaidh tú cuardach a dhéanamh ar fhóilió ar landdirect.ie nó féadfaidh tú iniúchadh a dhéanamh ar chóip bhán d’fhóilió in oifigí poiblí an ÚCM. Gearrtar costas €5 air seo

source: You can also request a certified copy, which costs €40
ga: Chomh maith leis sin, féadfaidh tú iarraidh ar chóip dheimhnithe, a chosnaíonn €40

source: There is more detail in these FAQs
ga: Tá breis sonraí ar fáil sna Ceisteanna Coitianta seo

source: Read more about the Land Registry on prai.ie
ga: Is féidir leat níos mó a léamh faoi Chlárlann na Talún ar prai.ie

source: If the property is not registered in the Land Registry it may have been dealt with by the Registry of Deeds
ga: Mura bhfuil an réadmhaoin cláraithe le Clárlann na Talún, b’fhéidir gur dhéileáil Clárlann na nGníomhas léi

source: Registration of Deeds system
ga: An Córas Cláraithe Gníomhas

source: The Registry of Deeds was established in 1708 for the purpose of registering and filing memorials of deeds or conveyances of unregistered land
ga: Bunaíodh Clárlann na nGníomhas i 1708 ar mhaithe le meabhracháin ghníomhas nó tíolacas de chuid talamh neamhchláraithe a chlárú agus a chomhdú

source: A memorial is a summary of the deed, giving the date, the names and descriptions of all parties and all witnesses to the deed and a description of the property affected by the deed
ga: Achoimre ar an ngníomhas atá i meabhrachán, ina dtugtar dáta, ainmneacha agus cur síos ar gach páirtí agus gach finné leis an ngníomhas mar aon le cur síos ar an réadmhaoin a n-imríonn an gníomhas tionchar uirthi

source: Since May 2008, memorials have been replaced by ROD application forms
ga: Ó Bhealtaine 2008, tháinig foirmeacha iarratais Chláraithe Gníomhas (CG) in ionad meabhrachán

source: When a deed is lodged in the Registry of Deeds it is not filed there permanently - it is returned to the party who lodged it for registration
ga: Nuair a chuirtear gníomhas i dtaisce i gClárlann na nGníomhas, ní chomhdaítear é sa chlárlann go buan – seoltar ar ais é chuig an bpáirtí a chuir i dtaisce é ar mhaithe le clárú

source: Instead a ROD application form (formerly a memorial) is filed
ga: Ina ionad sin, comhdaítear foirm iarratas CG (meabhrachán roimhe seo)

source: The new signed deed becomes the latest deed showing the ownership of the property, adding to a chain of deeds that go back to when the property was first registered
ga: Déantar an gníomhas is déanaí den ghníomhas nua sínithe ina léirítear úinéireacht na réadmhaoine, agus cuirtear é le slabhra gníomhas a ghabhann siar go dtí an tráth a cláraíodh an réadmhaoin i dtosach

source: Deeds that are recorded in the Registry of Deeds have a legal priority over unrecorded deeds and other deeds recorded later in time
ga: Tugtar tús áite dlíthiúil do ghníomhais atá curtha i dtaifead i gClárlann na nGníomhas thar ghníomhais neamhthaifeadta agus gníomhais eile a cuireadh i dtaifead níos déanaí ná sin

source: As the memorial or ROD application form is on public record at the Registry of Deeds, anyone can inspect it and see who owns the property
ga: Mar gheall go bhfuil an meabhrachán nó an fhoirm iarratais CG ar thaifead poiblí ag Clárlann na nGníomhas, is féidir le duine ar bith iad a iniúchadh féachaint cé leis an réadmhaoin

source: However, a purchaser of unregistered land must read the actual deeds to examine the title to the property
ga: Ní mór do cheannaitheoir talún neamhchláraithe na gníomhais féin a léamh chun scrúdú a dhéanamh ar an teideal i leith na réadmhaoine, áfach

source: Because the Registry of Deeds keeps a memorial or ROD application form summarising the change of ownership or mortgage, you can get a copy of this document to replace a lost or misplaced deed
ga: Mar gheall go gcoimeádann Clárlann na nGníomhas meabhrachán nó foirm iarratais CG ina dtugtar achoimre ar an athrú úinéireachta nó ar mhorgáiste, féadfaidh tú cóip a fháil den cháipéis seo chun gníomhas a cailleadh nó atá ar iarraidh a ionadú

source: A memorial or ROD application form does not have the same legal effect as a deed but provides secondary evidence of the contents of the deed
ga: Ní bhíonn an tionchar dlí céanna ag meabhrachán agus atá ag gníomhas, ach cuireann sé fianaise thánaisteach ar fáil faoin méid atá sa ghníomhas

source: You can get a certified copy for €20 and a plain copy for €1 per page
ga: Féadfaidh tú cóip dheimhnithe a fháil ar €20 agus cóip bhán a fháil ar €1 an leathanach

source: Read more about the Registry of Deeds on prai.ie
ga: Is féidir níos mó a léamh faoi Chlárlann na nGníomhas ar prai.ie
